
  #### npr results:

  <details><summary>Terraform Fmt: <code>failure</code></summary><br>

  ```

  environments/npr/main.tf
environments/npr/terraform.tfvars

  ```

  </details>

  <details><summary>Terraform Plan: <code>success</code></summary><br>

  ```

  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.pubsub.google_pubsub_topic.pubsub_topic["pubsub1"] will be created
  + resource "google_pubsub_topic" "pubsub_topic" {
      + id      = (known after apply)
      + name    = "pubsub1"
      + project = "halara-dev"

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

  # module.pubsub.google_pubsub_topic.pubsub_topic["pubsub2"] will be created
  + resource "google_pubsub_topic" "pubsub_topic" {
      + id      = (known after apply)
      + name    = "pubsub2"
      + project = "halara-dev"

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

  ```

  </details>
